CuteMarkEd实现.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CuteMarkEd markdown编辑器实现（一）</title>
<!-- 2015-11-21 六 10:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="walter" />
<link rel="stylesheet" href="css/worg.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">CuteMarkEd markdown编辑器实现（一）</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">界面</a>
<ul>
<li><a href="#sec-1-1">主界面</a></li>
<li><a href="#sec-1-2">mainwindow的构造函数</a></li>
<li><a href="#sec-1-3">plainTextChanged槽</a></li>
<li><a href="#sec-1-4">显示html文档</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">界面</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">主界面</h3>
<div class="outline-text-3" id="text-1-1">
<p>
通过主界面文件mainwindow.ui,可以看到主界面由文件浏览界面，markdown编辑器部件，HTML preview(source view)，目录结构部件及
及markdown语法帮助部件组成，其中，
</p>

<ul class="org-ul">
<li>文件浏览界面，目录结构部件及markdown 语法帮助部件都是docWidget，可以移动隐藏的
</li>
<li>Html preview和source view是个tabWdiget,只可以同时显示一个，通过点击状态栏实现切换。
</li>
<li>markdown编辑器继承自QPlainTextEdit,编辑器的功能比较简洁（弱）。
</li>
<li>实现了常见的菜单，比如文件，编辑，查看，其他额外功能菜单和帮助菜单。文件菜单里，缺少一个最近打开
文件的菜单，后面可以看到是通过代码加进去的。
</li>
<li>通过比对，CuteMarkEd最终运行的主界面，可以发现还有显示行号，自动补全，markdown语法高亮等功能
</li>
</ul>
<p>
后面继续分析代码实现。
</p>

<ul class="org-ul">
<li>markdown editor的textChanged信号连接到了MainWindow的plainTextChanged槽。
</li>
</ul>

<p>
*主界面代码实现
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">mainwindow的构造函数</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>首先调用ui-&gt;setupUi构建ui文件生成的部件
</li>
<li>调用MainWindow的成员函数setupUi连接MainWindow内部件之间的信号槽,设置菜单栏Action的快捷键
</li>
</ul>
<p>
，设置状态栏，设置各docWdiget的初始显示状态,读取配置
</p>
<ul class="org-ul">
<li>最后根据配置初始化程序
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">plainTextChanged槽</h3>
<div class="outline-text-3" id="text-1-3">
<p>
plainTextChanged槽在editor的textChanged信号被触发后被调用，先来看看它的大致实现。
</p>

<ul class="org-ul">
<li>获取editor的内容
</li>
<li>设置统计单词标签
</li>
<li>调用html生成器(generator)的markdownTextChanged成员函数,生成HTML。（后面继续分析)
</li>
<li>设置文档被修改
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">显示html文档</h3>
<div class="outline-text-3" id="text-1-4">
<p>
generator生成完html后，会发送htmlResultReady的信号，调用MainWindow的htmlResultReady
槽，设置html文档现实在webveiw和htmlSourceTextEdit中。
</p>


<p>
以上就是markdown editor最简单的结构流程，后续继续分析其他功能，比如editor的语法高亮，generator
生成Html的过程，editor的单词自动补全，html的语法高亮，editor和webview之间的位置同步等。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: walter</p>
<p class="date">Created: 2015-11-21 六 10:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
